Extensions/src/Documents/ЗаданиеНаРаботу/ЗаданиеНаРаботу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЗаданиеНаРаботу</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидРабот</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦен</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КалендарьСотрудника</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Работы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДатаНачала</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Трудоемкость</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидРабот</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Заказчик</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>AzRyПроект</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

Extensions/src/Documents/ЗаданиеНаРаботу/ManagerModule.bsl
&Вместо("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаЗаданиеНаРаботу, СтруктураДополнительныеСвойства)
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	&Организация КАК Организация,
	|	ЗаданиеНаРаботуРаботы.ДатаНачала КАК Период,
	|	ВЫБОР
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ЗаданиеНаРаботуРаботы.Заказчик
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ЗаданиеНаРаботуРаботы.Заказчик.Владелец
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ЗаданиеНаРаботуРаботы.Заказчик.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВЫБОР
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Справочник.Контрагенты
	|			ТОГДА ЗНАЧЕНИЕ(Справочник.ДоговорыКонтрагентов.ПустаяСсылка)
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ЗаданиеНаРаботуРаботы.Заказчик
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ЗаданиеНаРаботуРаботы.Заказчик.Договор
	|	КОНЕЦ КАК Договор,
	|	ВЫБОР
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Справочник.Контрагенты
	|				ИЛИ ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Справочник.ДоговорыКонтрагентов
	|			ТОГДА ЗНАЧЕНИЕ(Документ.ЗаказПокупателя.ПустаяСсылка)
	|		КОГДА ЗаданиеНаРаботуРаботы.Заказчик ССЫЛКА Документ.ЗаказПокупателя
	|			ТОГДА ЗаданиеНаРаботуРаботы.Заказчик
	|	КОНЕЦ КАК ЗаказПокупателя,
	|	ЗаданиеНаРаботуРаботы.Ссылка.Сотрудник,
	|	ЗаданиеНаРаботуРаботы.Номенклатура,
	|	ЗаданиеНаРаботуРаботы.Характеристика,
	|	ЗаданиеНаРаботуРаботы.ВидРабот,
	|	ЗаданиеНаРаботуРаботы.Трудоемкость КАК ЗагрузкаПлан,
	|	ЗаданиеНаРаботуРаботы.Сумма КАК СуммаПлан,
	|	ЗаданиеНаРаботуРаботы.Ссылка.СтруктурнаяЕдиница,
	|	ЗаданиеНаРаботуРаботы.ДатаНачала КАК ВремяНачала,
	|	ЗаданиеНаРаботуРаботы.ДатаОкончания КАК ВремяОкончания,
	|	ЗаданиеНаРаботуРаботы.Комментарий
	// +++ { AzRy - [21.07.2021] - // -- // - Developer:გიორგი მამულაშვილი - Comment: ცალკე პროექტის ცნობარის დამატება
	|	,ЗаданиеНаРаботуРаботы.AzRyПроект КАК AzRyПроект
	// +++ } AzRy - [21.07.2021] - // -- // - Developer:გიორგი მამულაშვილი - Comment: ცალკე პროექტის ცნობარის დამატება
	|ИЗ
	|	Документ.ЗаданиеНаРаботу.Работы КАК ЗаданиеНаРаботуРаботы
	|ГДЕ
	|	ЗаданиеНаРаботуРаботы.Ссылка = &Ссылка
	|	И ЗаданиеНаРаботуРаботы.Трудоемкость > 0";
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаЗаданиеНаРаботу);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Результат = Запрос.Выполнить();
	ТаблицаЗаданияНаРаботу = Результат.Выгрузить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаЗаданияНаРаботу", ТаблицаЗаданияНаРаботу);

КонецПроцедуры
